Easy Level

Total number of survivors

Division of male and female passengers

Average age of passengers

Which class had the most passengers?

How many passengers traveled alone?

Total number of passengers onboard

Maximum and minimum fare paid

In [5]:
import pandas as pd

df = pd.read_csv("Titanic-Dataset.csv")

df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  Age_group    891 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

In [53]:
df = df.dropna(subset=['Age', 'Survived'])
df.shape

(714, 13)

In [54]:
# Total number of survivors

# Value count will return dataframe 
df['Survived'].value_counts()[1]

290

In [55]:
# Division of male and female passengers

df['Sex'].value_counts()

Sex
male      453
female    261
Name: count, dtype: int64

In [58]:
# Average age of passengers

df['Age'].mean()

29.69911764705882

In [87]:
# Which class had the most passengers?

most_common_class = df['Pclass'].value_counts().idxmax()
count = df['Pclass'].value_counts().max()

print(f"Class {most_common_class} had the most passengers with a total of {count}.")

Class 3 had the most passengers with a total of 355.

In [85]:
# How many passengers traveled alone?

len(df[(df['SibSp'] == 0) & (df['Parch'] == 0)])

404

In [61]:
# Total number of passengers onboard

len(df['PassengerId'].unique())

714

In [62]:
# Maximum and minimum fare paid

print("Maximum", df['Fare'].max(), "Minimum",df['Fare'].min())

Maximum 512.3292 Minimum 0.0

How many passengers survived from each class?

How many passengers survived from each sex?

What is the survival rate for each class?

Age-wise segregation: How many survived under age 18, 18–40, 40+?

Average fare paid by male vs. female passengers

Number of passengers who embarked from each port

Count of survivors based on alone or not alone

In [21]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
# How many passengers survived from each class?

df_survival = df.groupby('Pclass')['Survived'].value_counts()
df_survival

Pclass  Survived
1       1           122
        0            64
2       0            90
        1            83
3       0           270
        1            85
Name: count, dtype: int64

In [64]:
# How many passengers survived from each sex?

df.groupby('Sex')['Survived'].value_counts()

Sex     Survived
female  1           197
        0            64
male    0           360
        1            93
Name: count, dtype: int64

In [65]:
# What is the survival rate for each class?

Pclass3_Sur = len(df[(df['Pclass'] == 3) & df['Survived'] == 1])
Pclass3 = len(df['Pclass'] == 3)

rate3 = (Pclass3_Sur/Pclass3)*100

rate3

11.904761904761903

In [66]:
Pclass2_Sur = len(df[(df['Pclass'] == 2) & df['Survived'] == 1])
Pclass2 = len(df['Pclass'] == 2)

rate2 = (Pclass2_Sur/Pclass2)*100

rate2

11.624649859943977

In [67]:
Pclass1_Sur = len(df[(df['Pclass'] == 1) & df['Survived'] == 1])
Pclass1 = len(df['Pclass'] == 1)

rate1 = (Pclass1_Sur/Pclass1)*100

rate1

17.086834733893557

In [68]:
df.groupby('Pclass')['Survived'].mean().round(2)

Pclass
1    0.66
2    0.48
3    0.24
Name: Survived, dtype: float64

In [72]:
# Age-wise segregation: How many survived under age 18, 18–40, 40+?

def age_category(age):
    if age < 18:
        return 'Under Age'
    elif age > 18 and age <40:
        return "18-40"
    else:
        return "Above 40"
    

df["Age_group"] = df['Age'].apply(age_category)

df

C:\Users\User1\AppData\Local\Temp\ipykernel_21840\3970328188.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age_group"] = df['Age'].apply(age_category)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,18-40
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,18-40
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,18-40
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,18-40
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,18-40
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,18-40
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,18-40
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,18-40
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,18-40
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,18-40

In [73]:
# Filter survivors and count in each group

df.groupby('Age_group')['Survived'].value_counts()

Age_group  Survived
18-40      0           253
           1           159
Above 40   0           119
           1            70
Under Age  1            61
           0            52
Name: count, dtype: int64

In [78]:
# Average fare paid by male vs. female passengers

df.groupby('Sex')['Fare'].mean()

Sex
female    47.582759
male      27.268836
Name: Fare, dtype: float64

In [81]:
# Number of passengers who embarked from each port

df["Embarked"].value_counts()

Embarked
S    554
C    130
Q     28
Name: count, dtype: int64

In [84]:
# Count of survivors based on alone or not alone

def Person_Alone(row):
    if row['SibSp'] == 0 and row['Parch'] == 0:
        return "Alone"
    else:
        return "Family"
    

df["Alone_Status"] = df.apply(Person_Alone, axis = 1)

df["Alone_Status"].value_counts()

C:\Users\User1\AppData\Local\Temp\ipykernel_21840\247125935.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Alone_Status"] = df.apply(Person_Alone, axis = 1)

Alone_Status
Alone     404
Family    310
Name: count, dtype: int64